lkm.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Implementation of Loadable Kernel Module</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="title" content="The Implementation of Loadable Kernel Module"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-02-22 Sat."/>
<meta name="author" content="Yannik Li(Yanqing Li)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="./style.css" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">The Implementation of Loadable Kernel Module</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 The Introduction of Loadable Kernel Module(LKM)</a></li>
<li><a href="#sec-2">2 The Introduction of Executable and Linking Format</a></li>
<li><a href="#sec-3">3 The Process of Loading Module</a></li>
<li><a href="#sec-4">4 References</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The Introduction of Loadable Kernel Module(LKM)</h2>
<div class="outline-text-2" id="text-1">

<p>  <b>LKM</b> is an object file that contains code to extend the running kernel, or so-called base kernel,
  there are many system using the mechanithm, the representative one is Linux,
  Many device driver and filesystem in Linux are builded in module, and be loaded into the kernel dynamically when after the kernel have been booted up. <br/>
  A LKM module is just an object file and provides some interfaces that will be called by base kernel,
  in fact, loading a module into kernel is just the process to link the module with the target kernel.
  the file type of the object file maybe in ELF, AXF or other loadable file format. <br/>
  The following chapter will show you how to load a ELF format module into a given kernel.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The Introduction of Executable and Linking Format</h2>
<div class="outline-text-2" id="text-2">

<p>  <b>ELF</b> was originally developed and published by UNIX System Laboratories
  (USL) as part of the Application Binary Interface (ABI). The Tool Interface Standards committee
  (TIS) has selected the evolving ELF standard as a portable object file format that works on 32-bit Intel
  Architecture environments for a variety of operating systems.<br/>
  ELF has three main types of object files:<sup><sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup></sup>
</p><ul>
<li>A relocatable file holds code and data suitable for linking with other object files to create an executable
</li>
</ul>

<p>or a shared object file.
</p><ul>
<li>An executable file holds a program suitable for execution; the file specifies howe x e c(BA_OS) creates
</li>
</ul>

<p>a program's process image.
</p><ul>
<li>A shared object file holds code and data suitable for linking in two contexts.
</li>
</ul>

<p>  The detail about ELF file format can reference ELF Specification Version 1.1.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The Process of Loading Module</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>first, get ELF header(ehdr) from file offset 0
</li>
<li>then get secton header from the offset ehdr.e<sub>shoff</sub>
</li>
<li>get the size and number fo section header from ehdr.e_shentsizeºÍehdr.e<sub>shnum</sub>
</li>
<li>get the address of string table header(strable) with the value of ehdr.e_shoff + ehdr.e_shentsize * ehdr.e_shstrndx
</li>
<li>then get the real position of string table with strtable.sh_offset
</li>
<li>traversing all sections, get the name for each section and compare with the section name string ".text", ".data", ".bss", ".rodata", and so on, to get the position and size for each expected section.
</li>
<li>at last, also is the most important, to relocate the symbol in each section with the information in the corresponding rel and rela section.
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> . Executable and Linkable Format Specification, Version 1.1
</p></div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-02-22 Sat.</p>
<p class="author">Author: Yannik Li(Yanqing Li)</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
